# Задача-1: поработайте с переменными, создайте несколько,
# выведите на экран, запросите от пользователя и сохраните в переменную,  выведите на экран
a = int(input("введите число "))
b = 5
c = int(a+b)
print (a)
print (c)
