# Задание - 2
# Создайте функцию, принимающую на вход 3 числа, и возвращающую наибольшее из них

def maximum():
    a = int(input("введите первое число "))
    b = int(input("введите второе число "))
    c = int(input("введите третье число "))
    print(max(a, b, c))

maximum()
